
{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Bechno Kid&#39;s Hideout - JSON Feed",
  "home_page_url": "https://bechnokid.neocities.org",
  "feed_url": "https://bechnokid.neocities.org/feeds/feed.json",
  "description": "The latest (and greatest?) from a beet disguised as a masked humanoid entity.",
  "user_comment": "This is a JSON feed. You can subscribe by copying the URL from the address bar into your newsreader!",
  "authors": {
    "name": "Bechno Kid",
    "url": "https://bechnokid.neocities.org"
  },
  "items": [
    
      {
        "id": "bechnokid-12/29/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Dec 30, 2025",
        "content_html": "<p>Hi everyone! I hope everyone has had a good time during the winter holidays. This will be the last update for the year. :D</p>\n<p>There are so many changes in this update that I'm not sure if I can put them all in this single entry without it being too overwhelming. XD</p>\n<p>So, I'll list the most important ones (to me)!</p>\n<ul>\n<li>New artwork in the <a href=\"/art/digimon\">Digimon</a> section</li>\n<li>Made a <a href=\"/to-do\">to-do</a> list for the site</li>\n<li>Added two <a href=\"/links\">links</a></li>\n<li>Meadow's guestbook service is currently down, so I linked to my <a href=\"https://bechnokid.atabook.org/\">atabook</a> instead. Hopefully it gets fixed soon!</li>\n<li>Optimization updates (hopefully):\n<ul>\n<li>Consolidated most of my JS files into one</li>\n<li>Fixed up JS for webrings page</li>\n</ul>\n</li>\n</ul>\n",
        "date_published": "2025-12-30T08:00:00Z"
      },
    
      {
        "id": "bechnokid-12/7/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Dec 8, 2025",
        "content_html": "<p>Hi everyone! It's another cold day in December. We actually had one snow day here! We sadly haven't had snow since then, but I'm holding out hop that it will snow on Christmas!</p>\n<p>This update seems pretty small, but that's because most of the updates were on the back end! However, an update is still an update!</p>\n<p>Here are the latest changes:</p>\n<ul>\n<li>Added new clique: <a href=\"https://crystallizing.neocities.org\">Crystallizing</a>. Yes, I chose that gem specifically because of that one animanga, teehee.</li>\n<li>Updated <a href=\"/feeds\">RSS</a> and made into page that holds other feeds</li>\n<li>Cosmetic updates including:\n<ul>\n<li>Unifying colors, especially colors for links</li>\n<li>Updated <a href=\"/not_found\">404 page</a> image to better match my current look</li>\n</ul>\n</li>\n<li>Backend updates and fixes including:\n<ul>\n<li>Minifying and bundling CSS for optimization (hopefully the CSS is still readable to use as reference!)</li>\n<li>Updated CSS and JS code for Freezeframe script thanks to <a href=\"https://friendshaped.garden\">FriendShapedPlant</a>!</li>\n</ul>\n</li>\n</ul>\n<p>That's it for now! See you next time!</p>\n",
        "date_published": "2025-12-08T08:00:00Z"
      },
    
      {
        "id": "bechnokid-11/27/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Nov 28, 2025",
        "content_html": "<p>Hi everyone! I had a great Thanksgiving and a peaceful Black Friday. Looking forward to the winter holidays now!</p>\n<p>Here's what's in this joyous update!</p>\n<section>\n<h4 id=\"major-updates\" tabindex=\"-1\">Major Updates</h4>\n<ul>\n<li>New artwork in <a href=\"/art/digimon\">Digimon</a></li>\n<li><a href=\"/resources/tutorials/freezeframe\">FreezeframeJS tutorial</a>:\n<ul>\n<li>Created a new script</li>\n<li>Completely rewrote the tutorial on how to use the new script</li>\n</ul>\n</li>\n<li><a href=\"/outgoing/webgarden\">Webgarden</a>:\n<ul>\n<li>Added more pots</li>\n<li>Slightly updated the layout so I can fit more pots</li>\n<li>Minor revamp of my own web garden pot. I noticed the spacing would look off in some other's sites, oops.</li>\n</ul>\n</li>\n<li><a href=\"/links\">Links</a>:\n<ul>\n<li>Added more links</li>\n<li>Added some sections</li>\n</ul>\n</li>\n<li>Removed FreezeframeJS script and added my own</li>\n</ul>\n</section>\n<section>\n<h4 id=\"minor-updates\" tabindex=\"-1\">Minor Updates</h4>\n<ul>\n<li><a href=\"/about\">About Me</a> page:\n<ul>\n<li>Added more favorite Digimon</li>\n<li>Replaced static Digimon images with moving ones</li>\n</ul>\n</li>\n<li><a href=\"/resources/code-snippets\">Code Snippets</a> page:\n<ul>\n<li>Added some CSS to allow users to pause the marquee</li>\n</ul>\n</li>\n<li>Fixed the <a href=\"/guestbook\">Guestbook</a>. I didn't realize it wasn't displaying all of the messages, which I deeply apologize for!</li>\n<li>Other updates and fixes such as:\n<ul>\n<li>Removed the reliance on margins between items (as much as I can) and replacing them with the <code>gap</code> property used in grids and flex boxes.</li>\n</ul>\n</li>\n</ul>\n<p>That's it for now! I hope the holidays don't become stressful to you! You can do it!</p>\n</section>\n",
        "date_published": "2025-11-28T08:00:00Z"
      },
    
      {
        "id": "bechnokid-11/19/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Nov 20, 2025",
        "content_html": "<p>Hello, everyone! It's almost the end of November, which for a lot of you, means the beginning of winter holidays! I live in the US, so we have Thanksgiving coming up next week. I'm not sure what my family and I will be doing on that day, but I know that we don't usually have turkey!</p>\n<p>It's gotten even colder for us here in the Northern Hemisphere. For those in the Southern Hemisphere, I hope you're all enjoying some warm weather! I wonder what it's like to celebrate Christmas in the Southern Hemisphere...</p>\n<p>Here are the changes for this update!</p>\n<ul>\n<li>Completed a <a href=\"/writing/blog/2025-11-20\">100-question survey for webmasters</a>!</li>\n<li>Added some more <a href=\"/goodies/adopts\">adopts</a> as well as some that are orphaned.\n<ul>\n<li>I browsed through a lot of old pixel sites thanks to <a href=\"https://kawaiiattic.arunyi.art/\">Kawaii Attic</a>, and I noticed that there were special adopts that webmasters had that people can sign up or pay to adopt. Since the sites that adopted them went down or the adopts never went up for sale, I took it upon myself to collect some of them and put them up for adoption here!</li>\n</ul>\n</li>\n<li>Added more <a href=\"/quiz-results\">quiz results</a>.</li>\n<li>Added some <a href=\"/links\">links</a> as well as removed some that are dead/inactive.</li>\n<li>Added a ton of web cliques on home and in <a href=\"/joined\">/joined</a>. They're so much fun!</li>\n<li>Updated the layout for the <a href=\"/curses\">curses generator</a>. I don't have any new ones, yet, but I'm hoping to add more! <img class='inline-img' src='/assets/images/blog/emoticon/emote_wink.png' aria-hidden='true' alt=''></li>\n<li>Updated my <a href=\"/about\">/about</a> page to talk less about my job. I realize I've been saying, &quot;Yeah, I'm a <em>software developer</em>&quot; a lot, which I imagine makes me sound pretty pretentious. <img class='inline-img' src='/assets/images/blog/emoticon/emote_embarrassed.png' aria-hidden='true' alt=''></li>\n<li>Responsiveness changes including:\n<ul>\n<li>Making the site look better on tablets, such as iPads, Kindles, etc.</li>\n</ul>\n</li>\n<li>Cosmetic changes including:\n<ul>\n<li>Adding colors for links that have been visited. This should make it a bit easier for users to tell which links they have already visited. If you're someone like me who cleans up her history every week, this might not be entirely useful to you, but still!</li>\n<li>Changing the images for my favorite characters in my <a href=\"/about\">/about</a> page.</li>\n</ul>\n</li>\n<li>Bug fixes including:\n<ul>\n<li>Fixing broken links in sitemap</li>\n<li>Fixed spacing issues in a lot of pages</li>\n</ul>\n</li>\n</ul>\n<p>That's it for now. Stay warm (or stay cool if in the Southern Hemisphere)!</p>\n",
        "date_published": "2025-11-20T08:00:00Z"
      },
    
      {
        "id": "bechnokid-11/4/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Nov 5, 2025",
        "content_html": "<p>Hello, everyone! I hope all of you are doing alright and that seasonal depression has passed for you. If not, then you can do it! I believe in you!</p>\n<p>It's gotten colder, but thankfully I like colder weather! It means I can bundle up, wear my longer coats, and look like a real anime protagonist! Ok, not really...</p>\n<p>Here are the changes for this update!</p>\n<ul>\n<li>New artwork in the <a href=\"/art/digimon\">Digimon</a> and <a href=\"/art/anime\">Anime</a> sections</li>\n<li>Added a section with my currently active social media accounts in <a href=\"/links\">Links</a></li>\n<li>New <a href=\"/blog\">blog</a> entry where I talk about my grievances with sites that repost graphics without giving credit to the original artists</li>\n<li>Finally decided to join more <a href=\"/joined\">fanlistings</a>!</li>\n<li>Cosmetic updates including:\n<ul>\n<li>Updating the dark mode colors</li>\n<li>Adding an icon after external links as well as changing the text color</li>\n<li>Figuring out how to add line numbers to code blocks for future snippets. This will help in pointing specific lines in any code I share!</li>\n<li>Moving the Play/Stop GIFs buttons to the navigation bar for easier access</li>\n<li>Creating a section dedicated to links that don't have buttons. I encourage others to visit those links!!</li>\n</ul>\n</li>\n</ul>\n<p>That's it for now. See you all next time!</p>\n",
        "date_published": "2025-11-05T08:00:00Z"
      },
    
      {
        "id": "bechnokid-10/27/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Oct 27, 2025",
        "content_html": "<p>It's almost Halloween!! I don't even have any special plans! I just love the holiday that much!!!</p>\n<p>The list of updates is small this time. :3</p>\n<ul>\n<li>Added three <a href=\"/quiz-results\">quiz results</a></li>\n<li>Updated <a href=\"/now\">/now</a> and also added a section for older entries! Huge thanks to <a href=\"https://mavisdeluna.art\">Mavis</a> for the idea!</li>\n<li>Other fixes and updates including:\n<ul>\n<li>Adding a loading screen to the <a href=\"/outgoing/webgarden\">Webgarden</a></li>\n<li>Updated the styling for &lt;h3&gt; tags to be underlined in almost every page</li>\n</ul>\n</li>\n</ul>\n",
        "date_published": "2025-10-27T08:00:00Z"
      },
    
      {
        "id": "bechnokid-10/21/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Oct 21, 2025",
        "content_html": "<p>Happy <a href=\"https://blog.playstation.com/2025/10/20/festival-of-accord-dreamspell-comes-to-monster-hunter-wilds-starting-october-22/\">Dreamspell Festival</a> Eve! I honestly wish I would make more of a habit uploading my art here as soon as I finish drawing it, but I love making updates to the site as well! <img class='inline-img' src='/assets/images/blog/emoticon/emote_happy.png' aria-hidden='true' alt=''></p>\n<p>Here are the spooky changes for this update:</p>\n<ul>\n<li>New artwork in the <a href=\"/art/digimon\">Digimon</a> section</li>\n<li>Added a new <a href=\"/links\">link</a></li>\n<li>Added back the <a href=\"/resources/code-snippets\">code snippets</a> page! The old snippets are no longer there, but there are some new ones! Check them out if you'd like! I'm hoping to update this a little more frequently!</li>\n<li>The <a href=\"/goodies/pixel_clubs\">pixel club</a> page got a revamp for easier viewing, and I added the Bottlecaps pixel club!</li>\n<li>Added some <a href=\"/goodies/graphics\">honeycomb stamp</a> graphics! I had been meaning to add them for a while, but making the CSS took a little bit of work!</li>\n<li>Cosmetic updates and other fixes, including:\n<ul>\n<li>Added a loading screen to graphic-heavy pages</li>\n<li>I removed most of the <i class='ft-alert-triangle index'></i> icons as a result, but only if JS is enabled! They are still there if JS is disabled!</li>\n<li>Added <a href=\"/sitemap\">sitemap</a> to the navigation sidebar for easier access</li>\n</ul>\n</li>\n</ul>\n<p>That's it for now! See you later, and I hope everyone has a great Halloween in 10 days!</p>\n",
        "date_published": "2025-10-21T08:00:00Z"
      }
    
  ]
}