
{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Bechno Kid&#39;s Hideout - JSON Feed",
  "home_page_url": "https://bechnokid.neocities.org",
  "feed_url": "https://bechnokid.neocities.org/feeds/feed.json",
  "description": "The latest (and greatest?) from a beet disguised as a masked humanoid entity.",
  "user_comment": "This is a JSON feed. You can subscribe by copying the URL from the address bar into your newsreader!",
  "authors": {
    "name": "Bechno Kid",
    "url": "https://bechnokid.neocities.org"
  },
  "items": [
    
      {
        "id": "bechnokid-2/9/2026",
        "url": "https://bechnokid.neocities.org",
        "title": "Feb 9, 2026",
        "content_html": "<p>Added a new section for affiliates in my <a href=\"https://bechnokid.neocities.org/links\">links</a> section!</p>\n<p>If you'd like to be an affiliate, just shoot me an email at <strong>bechnokid@yahoo.com</strong>!</p>\n<p>The only requirements I have is that your website isn't just an &quot;About Me&quot; page. Not that those are bad or anything, but I love sites with a ton of content in it, whether it's art, blogging, writing, anything!</p>\n<p>That's it for now! Have a great day, everyone!</p>\n",
        "date_published": "2026-02-09T00:00:00Z"
      },
    
      {
        "id": "bechnokid-2/7/2026",
        "url": "https://bechnokid.neocities.org",
        "title": "Feb 7, 2026",
        "content_html": "<p>Whoa, two updates in a week? It's almost unheard of!</p>\n<p>Here's what's in today's update!</p>\n<ul>\n<li><a href=\"https://bechnokid.neocities.org/tutorials/rss-feed\">New tutorial</a>! This one is for adding full descriptions to &quot;prettified&quot; RSS Feeds.</li>\n<li>The old <a href=\"https://bechnokid.neocities.org/guestbook\">guestbook</a> has returned! Yippee!!</li>\n<li>Added a section for <a href=\"https://bechnokid.neocities.org/joined\">pending webrings</a>.</li>\n<li>Other fixes such as:\n<ul>\n<li>Reorganizing and cleaning up a lot of pages</li>\n<li>Culling some of the quiz results and putting them in my <a href=\"https://bechnokid.neocities.org/about\">/about</a> page.</li>\n</ul>\n</li>\n</ul>\n<p>That's it for now! I hope all of you have a great day!</p>\n",
        "date_published": "2026-02-07T00:00:00Z"
      },
    
      {
        "id": "bechnokid-2/5/2026",
        "url": "https://bechnokid.neocities.org",
        "title": "Feb 5, 2026",
        "content_html": "<p>Hello, everyone! I hope things are going ok for all of you! It's still pretty cold, but I hear that it'll get warmer next week! Just in time for my birthday!</p>\n<p>Here's what's new in this update!</p>\n<ul>\n<li>I moved the light/dark toggle button to be positioned below the navigation sidebar! I figured this might be easier to access since the sidebar is always fixed in one position.</li>\n<li>New art in the <a href=\"/art/anime\">anime</a> section!</li>\n<li>Added a new <a href=\"/resources/code-snippets\">code snippet</a>. I think Tumblr veterans might recognize this one. 😉</li>\n<li>Updated <a href=\"/now\">now</a> and <a href=\"/goodies/pixel-clubs\">pixel club</a> pages!</li>\n<li>I will also mention that I also added in new links, but seeing as how I seem to <em>always</em> add in new links with every update, I figure I won't announce it this time. 😅</li>\n</ul>\n<p>That's it for now. See you next time!</p>\n",
        "date_published": "2026-02-05T00:00:00Z"
      },
    
      {
        "id": "bechnokid-1/29/2026",
        "url": "https://bechnokid.neocities.org",
        "title": "Jan 29, 2026",
        "content_html": "<p>Hello everyone! I hope you are all doing well. We all experienced a pretty nasty cold front over here in the East Coast, which makes me all the more grateful that I've been working from home. I hope you are all staying warm this winter!</p>\n<p>Here are the latest updates!</p>\n<ul>\n<li>New art in the <a href=\"/art/anime\">Anime</a> and <a href=\"/art/other\">Other</a> sections!</li>\n<li>Lots of new goodies, including:\n<ul>\n<li>Two more <a href=\"/goodies/pocket-bishies\">Pocket Bishounen</a> quizzes to take.</li>\n<li>Lots of graphics I <a href=\"/goodies/adopts\">adopted</a></li>\n<li>Some graphics I collected for <a href=\"/goodies/pixel-clubs\">pixel clubs</a></li>\n</ul>\n</li>\n<li>Added more <a href=\"/links\">links</a>! One day, I'll be brave and ask some of these new sites to be  affiliates! One day!</li>\n<li>Various bug fixes and minor updates</li>\n</ul>\n<p>That's it for now! I hope you all of a wonderful day!</p>\n",
        "date_published": "2026-01-29T00:00:00Z"
      },
    
      {
        "id": "bechnokid-1/15/2026",
        "url": "https://bechnokid.neocities.org",
        "title": "Jan 15, 2026",
        "content_html": "<p>Happy New Year everyone! Today is also the day that the long-awaited version 3.0 of Animal Crossing New Horizons is released! I hope everyone has fun with it.</p>\n<p>There are some pretty big updates today:</p>\n<ul>\n<li>New artwork in the <a href=\"/art/game\">Games</a> section! This is technically a crossover piece, but I don't have enough to make a new section yet lol</li>\n<li>New page: <a href=\"/me/fan\">Fangirling</a>, a page that's just me rambling about my experiences and preferences as a fan of media!</li>\n<li><a href=\"/resources/status-cafe/themes\">Status Cafe themes</a>:\n<ul>\n<li>Did a huge rehaul by improving how a theme is previewed and installing a button that will copy the code to your clipboard, making it easy to just paste it into the text box for the <strong>About</strong> section,</li>\n<li>Added a new theme! Those from Neocities in 2022-2023 might recognize it lol. I'm being a little shameless with this one hehe.</li>\n</ul>\n</li>\n<li>Added some more links! The more links I move from my bookmarks to this page, the more cool websites I keep finding. This is what I love about the indie web hehe.</li>\n</ul>\n<p>That's it for now. I hope everyone has a great day!</p>\n",
        "date_published": "2026-01-15T00:00:00Z"
      },
    
      {
        "id": "bechnokid-12/30/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Dec 30, 2025",
        "content_html": "<p>Hi everyone! I hope everyone has had a good time during the winter holidays. This will be the last update for the year. :D</p>\n<p>There are so many changes in this update that I'm not sure if I can put them all in this single entry without it being too overwhelming. XD</p>\n<p>So, I'll list the most important ones (to me)!</p>\n<ul>\n<li>New artwork in the <a href=\"/art/digimon\">Digimon</a> section</li>\n<li>Made a <a href=\"/to-do\">to-do</a> list for the site</li>\n<li>Added two <a href=\"/links\">links</a></li>\n<li>Meadow's guestbook service is currently down, so I linked to my <a href=\"https://bechnokid.atabook.org/\">atabook</a> instead. Hopefully it gets fixed soon!</li>\n<li>Optimization updates (hopefully):\n<ul>\n<li>Consolidated most of my JS files into one</li>\n<li>Fixed up JS for webrings page</li>\n</ul>\n</li>\n</ul>\n",
        "date_published": "2025-12-30T00:00:00Z"
      },
    
      {
        "id": "bechnokid-12/8/2025",
        "url": "https://bechnokid.neocities.org",
        "title": "Dec 8, 2025",
        "content_html": "<p>Hi everyone! It's another cold day in December. We actually had one snow day here! We sadly haven't had snow since then, but I'm holding out hop that it will snow on Christmas!</p>\n<p>This update seems pretty small, but that's because most of the updates were on the back end! However, an update is still an update!</p>\n<p>Here are the latest changes:</p>\n<ul>\n<li>Added new clique: <a href=\"https://crystallizing.neocities.org\">Crystallizing</a>. Yes, I chose that gem specifically because of that one animanga, teehee.</li>\n<li>Updated <a href=\"/feeds\">RSS</a> and made into page that holds other feeds</li>\n<li>Cosmetic updates including:\n<ul>\n<li>Unifying colors, especially colors for links</li>\n<li>Updated <a href=\"/not_found\">404 page</a> image to better match my current look</li>\n</ul>\n</li>\n<li>Backend updates and fixes including:\n<ul>\n<li>Minifying and bundling CSS for optimization (hopefully the CSS is still readable to use as reference!)</li>\n<li>Updated CSS and JS code for Freezeframe script thanks to <a href=\"https://friendshaped.garden\">FriendShapedPlant</a>!</li>\n</ul>\n</li>\n</ul>\n<p>That's it for now! See you next time!</p>\n",
        "date_published": "2025-12-08T00:00:00Z"
      }
    
  ]
}